Revit 2024 API
ViewPrintingEventArgs.View Property
 The view to be printed.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2010
Syntax
C#
public View View { get; }
Visual Basic
Public ReadOnly Property View As View
	Get
Visual C++
public:
property View^ View {
	View^ get ();
}
See Also
ViewPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace